# SrndArea

## Description
Function SrndArea when given a point, returns the area of the smallest polygon bounded by the selected objects.

```pascal
FUNCTION SrndArea(pX,pY : REAL): REAL;
```

```python
def vs.SrndArea(p):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|p|REAL|Coordinates of reference point.|

## Remarks
Given a point, returns the area of the smallest polygon bounded by the selected objects.  Returns nil if none can be found.

[sd 8/18/98]

## Version
Availability: from All Versions

## Category
* Graphic Calculation